64gs_MB-MC64K_MBMCCGVFGBAW-5_KPSK322EG240.txt
Seq1M-Read-Q8: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Write-Q8: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Read: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq1M-Write: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4K-Q32: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4K-Q32: (g=5): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Read-4K: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Write-4K: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 8 processes
3;fio-3.28;Seq1M-Read-Q8;0;0;1048576;86860;84;12072;544;23658;11739.357420;1584.728419;23629;95306;82291.397962;3164.908379;1.000000%=71827;5.000000%=81264;10.000000%=81264;20.000000%=82313;30.000000%=82313;40.000000%=82313;50.000000%=82313;60.000000%=82313;70.000000%=82313;80.000000%=83361;90.000000%=83361;95.000000%=84410;99.000000%=85458;99.500000%=93847;99.900000%=94896;99.950000%=94896;99.990000%=94896;0%=0;0%=0;0%=0;35289;106380;94033.797845;3159.891601;77913;88240;99.692909%;86593.260870;2225.892226;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.231961%;1.391765%;1029;0;2058;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.29%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%
3;fio-3.28;Seq1M-Write-Q8;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;33831;33;30994;106;43340;30202.605106;3134.690362;29684;245769;211238.194994;15462.584677;1.000000%=191889;5.000000%=193986;10.000000%=196083;20.000000%=200278;30.000000%=202375;40.000000%=206569;50.000000%=210763;60.000000%=212860;70.000000%=217055;80.000000%=223346;90.000000%=229638;95.000000%=233832;99.000000%=242221;99.500000%=244318;99.900000%=246415;99.950000%=246415;99.990000%=246415;0%=0;0%=0;0%=0;57994;277289;241445.048830;16671.155893;20295;36937;99.593253%;33693.393443;2550.906207;0.590456%;0.574323%;1056;0;10;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.10%;0.20%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%
3;fio-3.28;Seq1M-Read;2;0;1048576;85347;83;12286;93;671;170.662575;24.084020;11399;13565;11807.942705;204.003081;1.000000%=11468;5.000000%=11599;10.000000%=11599;20.000000%=11599;30.000000%=11730;40.000000%=11862;50.000000%=11862;60.000000%=11862;70.000000%=11862;80.000000%=11993;90.000000%=11993;95.000000%=11993;99.000000%=12124;99.500000%=12910;99.900000%=13565;99.950000%=13565;99.990000%=13565;0%=0;0%=0;0%=0;11575;13774;11980.288638;204.958093;83187;88240;100.000000%;85436.291667;1625.712726;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.244200%;1.831502%;1036;0;267;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;100.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%
3;fio-3.28;Seq1M-Write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;33677;32;31136;151;401;281.906241;33.972455;23340;43093;30105.103499;3040.859113;1.000000%=26083;5.000000%=26607;10.000000%=27131;20.000000%=27656;30.000000%=28180;40.000000%=28966;50.000000%=29491;60.000000%=30015;70.000000%=30801;80.000000%=32374;90.000000%=33816;95.000000%=35913;99.000000%=40632;99.500000%=41680;99.900000%=42729;99.950000%=43253;99.990000%=43253;0%=0;0%=0;0%=0;23668;43381;30388.707580;3041.301276;30720;36937;100.000000%;33724.508197;1931.905300;0.513891%;0.700177%;1040;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;100.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%
3;fio-3.28;Rand-Read-4K-Q32;4;0;645744;10762;2690;60001;4;1710;366.445255;19.546078;746;13443;11522.973214;232.997310;1.000000%=11206;5.000000%=11206;10.000000%=11206;20.000000%=11337;30.000000%=11337;40.000000%=11468;50.000000%=11599;60.000000%=11599;70.000000%=11599;80.000000%=11730;90.000000%=11730;95.000000%=11862;99.000000%=12255;99.500000%=12517;99.900000%=12779;99.950000%=12910;99.990000%=13303;0%=0;0%=0;0%=0;1107;13814;11890.192656;238.550253;10340;11014;100.000000%;10769.680672;155.870597;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.623333%;5.123333%;161445;0;41;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;0.01%;0.01%;99.98%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%
3;fio-3.28;Rand-Write-4K-Q32;5;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;191940;3198;799;60002;64;40941;1233.429943;1014.529127;1032;132911;38748.379336;7402.840258;1.000000%=34865;5.000000%=35913;10.000000%=36438;20.000000%=36438;30.000000%=36962;40.000000%=37486;50.000000%=37486;60.000000%=38010;70.000000%=38535;80.000000%=40108;90.000000%=40632;95.000000%=41156;99.000000%=54788;99.500000%=123207;99.900000%=129499;99.950000%=130547;99.990000%=132644;0%=0;0%=0;0%=0;2172;133951;39983.611794;7531.193481;2576;3398;100.000000%;3199.731092;169.044458;1.613306%;5.239913%;48041;0;11;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;98.30%;1.08%;0.60%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%
3;fio-3.28;Rand-Read-4K;6;0;588856;9814;2453;60001;5;133;15.794078;4.641201;274;2040;388.546256;21.374745;1.000000%=325;5.000000%=374;10.000000%=378;20.000000%=378;30.000000%=382;40.000000%=382;50.000000%=387;60.000000%=391;70.000000%=395;80.000000%=395;90.000000%=399;95.000000%=407;99.000000%=473;99.500000%=489;99.900000%=544;99.950000%=651;99.990000%=1089;0%=0;0%=0;0%=0;284;2057;404.753788;23.612269;9456;10084;100.000000%;9823.319328;134.684247;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.643333%;5.768333%;147264;0;10;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;99.74%;0.23%;0.02%;0.02%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%
3;fio-3.28;Rand-Write-4K;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;180616;3010;752;60001;11;1779;57.189524;9.406352;5;39952;1258.538126;1037.067855;1.000000%=1011;5.000000%=1019;10.000000%=1036;20.000000%=1089;30.000000%=1089;40.000000%=1089;50.000000%=1105;60.000000%=1105;70.000000%=1122;80.000000%=1122;90.000000%=1138;95.000000%=1302;99.000000%=4423;99.500000%=4620;99.900000%=13041;99.950000%=22151;99.990000%=34865;0%=0;0%=0;0%=0;941;40009;1316.720189;1037.224482;2424;3120;100.000000%;3014.403361;157.078104;2.093333%;6.276667%;45204;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.48%;95.22%;0.07%;4.13%;0.04%;0.06%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;310990;95143;2;0;210524;170321;380845;99.58%

Seq1M-Read-Q8: (groupid=0, jobs=1): err= 0: pid=8906: Wed Jul 31 19:35:01 2024
  read: IOPS=84, BW=84.8MiB/s (88.9MB/s)(1024MiB/12072msec)
    slat (usec): min=544, max=23658, avg=11739.36, stdev=1584.73
    clat (usec): min=23629, max=95306, avg=82291.40, stdev=3164.91
     lat (msec): min=35, max=106, avg=94.03, stdev= 3.16
    clat percentiles (usec):
     |  1.00th=[71828],  5.00th=[81265], 10.00th=[81265], 20.00th=[82314],
     | 30.00th=[82314], 40.00th=[82314], 50.00th=[82314], 60.00th=[82314],
     | 70.00th=[82314], 80.00th=[83362], 90.00th=[83362], 95.00th=[84411],
     | 99.00th=[85459], 99.50th=[93848], 99.90th=[94897], 99.95th=[94897],
     | 99.99th=[94897]
   bw (  KiB/s): min=77913, max=88240, per=99.69%, avg=86593.26, stdev=2225.89, samples=23
   iops        : min=   76, max=   86, avg=84.43, stdev= 2.17, samples=23
  lat (msec)   : 50=0.29%, 100=99.71%
  cpu          : usr=0.23%, sys=1.39%, ctx=1029, majf=0, minf=2058
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Write-Q8: (groupid=1, jobs=1): err= 0: pid=8911: Wed Jul 31 19:35:01 2024
  write: IOPS=33, BW=33.0MiB/s (34.6MB/s)(1024MiB/30994msec); 0 zone resets
    slat (usec): min=106, max=43340, avg=30202.61, stdev=3134.69
    clat (msec): min=29, max=245, avg=211.24, stdev=15.46
     lat (msec): min=57, max=277, avg=241.45, stdev=16.67
    clat percentiles (msec):
     |  1.00th=[  192],  5.00th=[  194], 10.00th=[  197], 20.00th=[  201],
     | 30.00th=[  203], 40.00th=[  207], 50.00th=[  211], 60.00th=[  213],
     | 70.00th=[  218], 80.00th=[  224], 90.00th=[  230], 95.00th=[  234],
     | 99.00th=[  243], 99.50th=[  245], 99.90th=[  247], 99.95th=[  247],
     | 99.99th=[  247]
   bw (  KiB/s): min=20295, max=36937, per=99.59%, avg=33693.39, stdev=2550.91, samples=61
   iops        : min=   19, max=   36, avg=32.84, stdev= 2.55, samples=61
  lat (msec)   : 50=0.10%, 100=0.20%, 250=99.71%
  cpu          : usr=0.59%, sys=0.57%, ctx=1056, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Read: (groupid=2, jobs=1): err= 0: pid=8915: Wed Jul 31 19:35:01 2024
  read: IOPS=83, BW=83.3MiB/s (87.4MB/s)(1024MiB/12286msec)
    slat (usec): min=93, max=671, avg=170.66, stdev=24.08
    clat (usec): min=11399, max=13565, avg=11807.94, stdev=204.00
     lat (usec): min=11575, max=13774, avg=11980.29, stdev=204.96
    clat percentiles (usec):
     |  1.00th=[11469],  5.00th=[11600], 10.00th=[11600], 20.00th=[11600],
     | 30.00th=[11731], 40.00th=[11863], 50.00th=[11863], 60.00th=[11863],
     | 70.00th=[11863], 80.00th=[11994], 90.00th=[11994], 95.00th=[11994],
     | 99.00th=[12125], 99.50th=[12911], 99.90th=[13566], 99.95th=[13566],
     | 99.99th=[13566]
   bw (  KiB/s): min=83187, max=88240, per=100.00%, avg=85436.29, stdev=1625.71, samples=24
   iops        : min=   81, max=   86, avg=83.29, stdev= 1.57, samples=24
  lat (msec)   : 20=100.00%
  cpu          : usr=0.24%, sys=1.83%, ctx=1036, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq1M-Write: (groupid=3, jobs=1): err= 0: pid=8916: Wed Jul 31 19:35:01 2024
  write: IOPS=32, BW=32.9MiB/s (34.5MB/s)(1024MiB/31136msec); 0 zone resets
    slat (usec): min=151, max=401, avg=281.91, stdev=33.97
    clat (usec): min=23340, max=43093, avg=30105.10, stdev=3040.86
     lat (usec): min=23668, max=43381, avg=30388.71, stdev=3041.30
    clat percentiles (usec):
     |  1.00th=[26084],  5.00th=[26608], 10.00th=[27132], 20.00th=[27657],
     | 30.00th=[28181], 40.00th=[28967], 50.00th=[29492], 60.00th=[30016],
     | 70.00th=[30802], 80.00th=[32375], 90.00th=[33817], 95.00th=[35914],
     | 99.00th=[40633], 99.50th=[41681], 99.90th=[42730], 99.95th=[43254],
     | 99.99th=[43254]
   bw (  KiB/s): min=30720, max=36937, per=100.00%, avg=33724.51, stdev=1931.91, samples=61
   iops        : min=   30, max=   36, avg=32.87, stdev= 1.89, samples=61
  lat (msec)   : 50=100.00%
  cpu          : usr=0.51%, sys=0.70%, ctx=1040, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K-Q32: (groupid=4, jobs=1): err= 0: pid=8920: Wed Jul 31 19:35:01 2024
  read: IOPS=2690, BW=10.5MiB/s (11.0MB/s)(631MiB/60001msec)
    slat (usec): min=4, max=1710, avg=366.45, stdev=19.55
    clat (usec): min=746, max=13443, avg=11522.97, stdev=233.00
     lat (usec): min=1107, max=13814, avg=11890.19, stdev=238.55
    clat percentiles (usec):
     |  1.00th=[11207],  5.00th=[11207], 10.00th=[11207], 20.00th=[11338],
     | 30.00th=[11338], 40.00th=[11469], 50.00th=[11600], 60.00th=[11600],
     | 70.00th=[11600], 80.00th=[11731], 90.00th=[11731], 95.00th=[11863],
     | 99.00th=[12256], 99.50th=[12518], 99.90th=[12780], 99.95th=[12911],
     | 99.99th=[13304]
   bw (  KiB/s): min=10340, max=11014, per=100.00%, avg=10769.68, stdev=155.87, samples=119
   iops        : min= 2585, max= 2753, avg=2692.31, stdev=38.97, samples=119
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.98%
  cpu          : usr=1.62%, sys=5.12%, ctx=161445, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=161436,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4K-Q32: (groupid=5, jobs=1): err= 0: pid=8921: Wed Jul 31 19:35:01 2024
  write: IOPS=799, BW=3199KiB/s (3276kB/s)(187MiB/60002msec); 0 zone resets
    slat (usec): min=64, max=40941, avg=1233.43, stdev=1014.53
    clat (usec): min=1032, max=132911, avg=38748.38, stdev=7402.84
     lat (msec): min=2, max=133, avg=39.98, stdev= 7.53
    clat percentiles (msec):
     |  1.00th=[   35],  5.00th=[   36], 10.00th=[   37], 20.00th=[   37],
     | 30.00th=[   37], 40.00th=[   38], 50.00th=[   38], 60.00th=[   39],
     | 70.00th=[   39], 80.00th=[   41], 90.00th=[   41], 95.00th=[   42],
     | 99.00th=[   55], 99.50th=[  124], 99.90th=[  130], 99.95th=[  131],
     | 99.99th=[  133]
   bw (  KiB/s): min= 2576, max= 3398, per=100.00%, avg=3199.73, stdev=169.04, samples=119
   iops        : min=  644, max=  849, avg=799.70, stdev=42.21, samples=119
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=98.30%
  lat (msec)   : 100=1.08%, 250=0.60%
  cpu          : usr=1.61%, sys=5.24%, ctx=48041, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,47985,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Read-4K: (groupid=6, jobs=1): err= 0: pid=8925: Wed Jul 31 19:35:01 2024
  read: IOPS=2453, BW=9814KiB/s (10.0MB/s)(575MiB/60001msec)
    slat (usec): min=5, max=133, avg=15.79, stdev= 4.64
    clat (usec): min=274, max=2040, avg=388.55, stdev=21.37
     lat (usec): min=284, max=2057, avg=404.75, stdev=23.61
    clat percentiles (usec):
     |  1.00th=[  326],  5.00th=[  375], 10.00th=[  379], 20.00th=[  379],
     | 30.00th=[  383], 40.00th=[  383], 50.00th=[  388], 60.00th=[  392],
     | 70.00th=[  396], 80.00th=[  396], 90.00th=[  400], 95.00th=[  408],
     | 99.00th=[  474], 99.50th=[  490], 99.90th=[  545], 99.95th=[  652],
     | 99.99th=[ 1090]
   bw (  KiB/s): min= 9456, max=10084, per=100.00%, avg=9823.32, stdev=134.68, samples=119
   iops        : min= 2364, max= 2521, avg=2455.50, stdev=33.69, samples=119
  lat (usec)   : 500=99.74%, 750=0.23%, 1000=0.02%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=1.64%, sys=5.77%, ctx=147264, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=147214,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-4K: (groupid=7, jobs=1): err= 0: pid=8928: Wed Jul 31 19:35:01 2024
  write: IOPS=752, BW=3010KiB/s (3082kB/s)(176MiB/60001msec); 0 zone resets
    slat (usec): min=11, max=1779, avg=57.19, stdev= 9.41
    clat (usec): min=5, max=39952, avg=1258.54, stdev=1037.07
     lat (usec): min=941, max=40009, avg=1316.72, stdev=1037.22
    clat percentiles (usec):
     |  1.00th=[ 1012],  5.00th=[ 1020], 10.00th=[ 1037], 20.00th=[ 1090],
     | 30.00th=[ 1090], 40.00th=[ 1090], 50.00th=[ 1106], 60.00th=[ 1106],
     | 70.00th=[ 1123], 80.00th=[ 1123], 90.00th=[ 1139], 95.00th=[ 1303],
     | 99.00th=[ 4424], 99.50th=[ 4621], 99.90th=[13042], 99.95th=[22152],
     | 99.99th=[34866]
   bw (  KiB/s): min= 2424, max= 3120, per=100.00%, avg=3014.40, stdev=157.08, samples=119
   iops        : min=  606, max=  780, avg=753.60, stdev=39.27, samples=119
  lat (usec)   : 10=0.01%, 1000=0.48%
  lat (msec)   : 2=95.22%, 4=0.07%, 10=4.13%, 20=0.04%, 50=0.06%
  cpu          : usr=2.09%, sys=6.28%, ctx=45204, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,45154,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=84.8MiB/s (88.9MB/s), 84.8MiB/s-84.8MiB/s (88.9MB/s-88.9MB/s), io=1024MiB (1074MB), run=12072-12072msec

Run status group 1 (all jobs):
  WRITE: bw=33.0MiB/s (34.6MB/s), 33.0MiB/s-33.0MiB/s (34.6MB/s-34.6MB/s), io=1024MiB (1074MB), run=30994-30994msec

Run status group 2 (all jobs):
   READ: bw=83.3MiB/s (87.4MB/s), 83.3MiB/s-83.3MiB/s (87.4MB/s-87.4MB/s), io=1024MiB (1074MB), run=12286-12286msec

Run status group 3 (all jobs):
  WRITE: bw=32.9MiB/s (34.5MB/s), 32.9MiB/s-32.9MiB/s (34.5MB/s-34.5MB/s), io=1024MiB (1074MB), run=31136-31136msec

Run status group 4 (all jobs):
   READ: bw=10.5MiB/s (11.0MB/s), 10.5MiB/s-10.5MiB/s (11.0MB/s-11.0MB/s), io=631MiB (661MB), run=60001-60001msec

Run status group 5 (all jobs):
  WRITE: bw=3199KiB/s (3276kB/s), 3199KiB/s-3199KiB/s (3276kB/s-3276kB/s), io=187MiB (197MB), run=60002-60002msec

Run status group 6 (all jobs):
   READ: bw=9814KiB/s (10.0MB/s), 9814KiB/s-9814KiB/s (10.0MB/s-10.0MB/s), io=575MiB (603MB), run=60001-60001msec

Run status group 7 (all jobs):
  WRITE: bw=3010KiB/s (3082kB/s), 3010KiB/s-3010KiB/s (3082kB/s-3082kB/s), io=176MiB (185MB), run=60001-60001msec

Disk stats (read/write):
  sdb: ios=310990/95143, merge=2/0, ticks=210524/170321, in_queue=380845, util=99.58%